{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "\\\\": 257,
      "Ġ$": 258,
      "Ġt": 259,
      "he": 260,
      "ĠĠ": 261,
      "Ġ\"": 262,
      "Ġa": 263,
      "Ġi": 264,
      "er": 265,
      "Ġthe": 266,
      "Ġo": 267,
      "le": 268,
      "re": 269,
      "Ġ\\\\": 270,
      "ti": 271,
      "nd": 272,
      "ve": 273,
      "ĠĠĠ": 274,
      "\":": 275,
      "Ġof": 276,
      "ha": 277,
      "Ġs": 278,
      "Ġis": 279,
      "Ġb": 280,
      "Ġw": 281,
      "Ġd": 282,
      "or": 283,
      "Ġ1": 284,
      "Ġp": 285,
      "ot": 286,
      "on": 287,
      "\",": 288,
      "um": 289,
      "$.": 290,
      "in": 291,
      "Ġf": 292,
      "iv": 293,
      "Ġin": 294,
      "Ġc": 295,
      "te": 296,
      "Ġn": 297,
      "ĠT": 298,
      "cd": 299,
      "Ġand": 300,
      "hat": 301,
      "ber": 302,
      "umber": 303,
      "$,": 304,
      "it": 305,
      "qu": 306,
      "al": 307,
      "Ġ2": 308,
      "Ġm": 309,
      "st": 310,
      "si": 311,
      "ac": 312,
      "vel": 313,
      "ble": 314,
      "ig": 315,
      "ro": 316,
      "cdot": 317,
      "ĠThe": 318,
      "Ġ=": 319,
      "ed": 320,
      "00": 321,
      "Ġthat": 322,
      "tion": 323,
      "es": 324,
      "Ġe": 325,
      "Ġ+": 326,
      "Ġ3": 327,
      "ivi": 328,
      "Ġdivi": 329,
      "ol": 330,
      "Ġto": 331,
      "se": 332,
      "Ġpo": 333,
      "Ġ5": 334,
      "an": 335,
      "Ġwe": 336,
      "Ġbe": 337,
      "Ġby": 338,
      "equ": 339,
      "igit": 340,
      "ul": 341,
      "Ġnumber": 342,
      "ger": 343,
      "od": 344,
      "Le": 345,
      "Ġinte": 346,
      "ar": 347,
      "equiv": 348,
      "Ġinteger": 349,
      "Ġre": 350,
      "Ġ$\\\\": 351,
      "Ġare": 352,
      "pe": 353,
      "im": 354,
      "10": 355,
      "hi": 356,
      "Ġ4": 357,
      "ution": 358,
      "olution": 359,
      "},": 360,
      "Ġ&": 361,
      "en": 362,
      "ox": 363,
      "ce": 364,
      "ty": 365,
      "blem": 366,
      "roblem": 367,
      "Ġdigit": 368,
      "box": 369,
      "ind": 370,
      "boxed": 371,
      "^{": 372,
      "ory": 373,
      "Number": 374,
      "mod": 375,
      "problem": 376,
      "solution": 377,
      "level": 378,
      "ĠTheory": 379,
      "Level": 380,
      "type": 381,
      "Ġg": 382,
      "},{": 383,
      "}$.": 384,
      "sible": 385,
      "Ġha": 386,
      "pmod": 387,
      "rac": 388,
      "ing": 389,
      "}$": 390,
      "Ġle": 391,
      "}{": 392,
      "Ġfor": 393,
      "ly": 394,
      "ch": 395,
      "tive": 396,
      "frac": 397,
      "ow": 398,
      "11": 399,
      "Ġon": 400,
      "\\\\\\": 401,
      "Ġso": 402,
      "ulti": 403,
      "act": 404,
      "Ġl": 405,
      "Ġ7": 406,
      "ple": 407,
      "Ġ(": 408,
      "Ġco": 409,
      "Ġposi": 410,
      "ma": 411,
      "Ġpositive": 412,
      "Ġ-": 413,
      "?\",": 414,
      "Ġmulti": 415,
      "ver": 416,
      "xt": 417,
      "ore": 418,
      "Ġan": 419,
      "Ġ9": 420,
      "rim": 421,
      "ll": 422,
      "12": 423,
      "Ġ6": 424,
      "Ġdivisible": 425,
      "us": 426,
      "}$.\"": 427,
      "han": 428,
      "ct": 429,
      "ĠS": 430,
      "Ġprim": 431,
      "hen": 432,
      "Ġfact": 433,
      "ince": 434,
      "ĠW": 435,
      "Ġhave": 436,
      "Ġcan": 437,
      "Ġfactor": 438,
      "his": 439,
      "Ġthan": 440,
      "Ġdivid": 441,
      "Ġmultiple": 442,
      "qua": 443,
      "ir": 444,
      "Ġas": 445,
      "Ġdigits": 446,
      "ss": 447,
      "text": 448,
      "100": 449,
      "ase": 450,
      "Ġsum": 451,
      "ur": 452,
      "Ġwhi": 453,
      "ge": 454,
      "Ġrema": 455,
      "Ġv": 456,
      "Ġor": 457,
      "Ġintegers": 458,
      "inder": 459,
      "Ġprime": 460,
      "Ġ8": 461,
      "}\\\\": 462,
      "wer": 463,
      "alu": 464,
      "Ġ\\\\\\\\\\": 465,
      "Ġit": 466,
      "Ġcon": 467,
      "Ġvalu": 468,
      "Ġwhich": 469,
      "ust": 470,
      "Ġremainder": 471,
      "Ġex": 472,
      "et": 473,
      "ith": 474,
      "Ġu": 475,
      "ign": 476,
      "Ġwhen": 477,
      "*}": 478,
      "tin": 479,
      "align": 480,
      "Ġmust": 481,
      "ho": 482,
      "Ġbase": 483,
      "ent": 484,
      "Ġ10": 485,
      "The": 486,
      "99": 487,
      "fore": 488,
      "ay": 489,
      "wo": 490,
      "Ġpos": 491,
      "refore": 492,
      ".\\": 493,
      "_{": 494,
      "rea": 495,
      "Ġtwo": 496,
      "gcd": 497,
      "Ġ0": 498,
      "sor": 499,
      "her": 500,
      "Ġdivisor": 501,
      "ec": 502,
      "ive": 503,
      "pre": 504,
      "Ġthis": 505,
      "Ġsu": 506,
      "dd": 507,
      "hus": 508,
      "=\\\\": 509,
      "mal": 510,
      "be": 511,
      "Ġnumbers": 512,
      "Ġwith": 513,
      "Ġsmal": 514,
      "Ġlea": 515,
      "Ġhas": 516,
      "Ġpossible": 517,
      "Ġthen": 518,
      "Ġnot": 519,
      "ta": 520,
      "Ġcom": 521,
      "ft": 522,
      "If": 523,
      "rom": 524,
      "ine": 525,
      "Ġdivided": 526,
      "20": 527,
      "Ġgrea": 528,
      "Ġthere": 529,
      "Ġfind": 530,
      "du": 531,
      "igh": 532,
      "Ġ$(": 533,
      "ight": 534,
      "Ġth": 535,
      "ĠTherefore": 536,
      "13": 537,
      "Ġonly": 538,
      "lest": 539,
      "Ġ100": 540,
      ".$": 541,
      "Ġsmallest": 542,
      "gin": 543,
      "Ġ12": 544,
      "me": 545,
      "Ġless": 546,
      "Ġpro": 547,
      "Ġlar": 548,
      "ting": 549,
      "Ġif": 550,
      "Ġall": 551,
      "irst": 552,
      "ach": 553,
      "15": 554,
      "end": 555,
      "Ġy": 556,
      "16": 557,
      ",$": 558,
      "ĠF": 559,
      "Ġdi": 560,
      "Ġequ": 561,
      "li": 562,
      "We": 563,
      "mon": 564,
      "What": 565,
      "Ġun": 566,
      "ĠA": 567,
      "ĠThus": 568,
      "Ġvalue": 569,
      "Ġlarge": 570,
      "ĠWe": 571,
      "begin": 572,
      "th": 573,
      ")$": 574,
      "ut": 575,
      "Ġ$$": 576,
      "ĠSince": 577,
      "quare": 578,
      "ter": 579,
      "ree": 580,
      "Ġsa": 581,
      "Ġsquare": 582,
      "$.\\": 583,
      "Ġsuch": 584,
      "25": 585,
      "Ġfrom": 586,
      "Ġne": 587,
      "Ġeach": 588,
      "Ġman": 589,
      ".\"": 590,
      "ri": 591,
      "Ġone": 592,
      "Ġgive": 593,
      ")(": 594,
      "Ġfactors": 595,
      "Ġthree": 596,
      "mes": 597,
      "digit": 598,
      "Ġfirst": 599,
      "Ġmany": 600,
      "line": 601,
      "Ġpower": 602,
      "Ġper": 603,
      "Ġcommon": 604,
      "Ġlargest": 605,
      "gr": 606,
      ".\\\\": 607,
      "row": 608,
      "ence": 609,
      "its": 610,
      "erm": 611,
      "Ġget": 612,
      ",\\\\": 613,
      "times": 614,
      "&=": 615,
      "ld": 616,
      "}$,": 617,
      "Ġform": 618,
      "Ġequal": 619,
      "Ġ11": 620,
      "iz": 621,
      "at": 622,
      "swer": 623,
      "Ġunits": 624,
      "fe": 625,
      "oth": 626,
      "Ġanswer": 627,
      "our": 628,
      "Let": 629,
      "Ġr": 630,
      "quad": 631,
      "ther": 632,
      "test": 633,
      "Ġgreatest": 634,
      "Ġprodu": 635,
      "14": 636,
      "24": 637,
      "17": 638,
      "How": 639,
      "Ġboth": 640,
      "uld": 641,
      "Ġproduct": 642,
      "Ġleast": 643,
      "Ġdo": 644,
      "fect": 645,
      "ation": 646,
      "Ġal": 647,
      "ven": 648,
      "Ġwi": 649,
      "Ġ&\\\\": 650,
      "Ġperfect": 651,
      "@{": 652,
      "*}\\": 653,
      "ots": 654,
      "Ġse": 655,
      "Ġvalues": 656,
      "Ġterm": 657,
      "ĠWhat": 658,
      "Ġk": 659,
      "Ġodd": 660,
      "Ġwill": 661,
      "23": 662,
      "we": 663,
      "\\\\\\\\\\": 664,
      "Ġmod": 665,
      "Ġdivisors": 666,
      "Ġat": 667,
      "arr": 668,
      "over": 669,
      "lo": 670,
      "ĠIf": 671,
      "sen": 672,
      "200": 673,
      "pli": 674,
      "ck": 675,
      "$?\",": 676,
      "50": 677,
      "here": 678,
      "gru": 679,
      "Ġmodul": 680,
      "ab": 681,
      "Ġcongru": 682,
      "ween": 683,
      "Ġdec": 684,
      "id": 685,
      "tween": 686,
      "oll": 687,
      "Ġbetween": 688,
      "19": 689,
      "so": 690,
      "Ġ200": 691,
      "Ġ&=": 692,
      "@{}": 693,
      "Ġeven": 694,
      "1000": 695,
      "&\\\\": 696,
      "ĠE": 697,
      "Ġh": 698,
      "presen": 699,
      "33": 700,
      "ond": 701,
      "Ġrepresen": 702,
      ")=": 703,
      "Ġme": 704,
      "Ġfactoriz": 705,
      "Ġst": 706,
      "imal": 707,
      "ĠSo": 708,
      "Ġ15": 709,
      "Ġsince": 710,
      "ff": 711,
      "Ġpa": 712,
      "),": 713,
      "Ġfoll": 714,
      "Ġmodulo": 715,
      "Ġfollow": 716,
      "ou": 717,
      "ldots": 718,
      "Ġdecimal": 719,
      "Ġother": 720,
      "ĠI": 721,
      "{(": 722,
      "Ġfour": 723,
      "Ġleft": 724,
      "press": 725,
      "18": 726,
      "ĠN": 727,
      "Ġ\\\\[": 728,
      "Ġ16": 729,
      "Ġwhere": 730,
      "Since": 731,
      "ate": 732,
      "der": 733,
      "ĠB": 734,
      "tain": 735,
      "}+": 736,
      "Ġ<": 737,
      "Ġus": 738,
      "Ġthese": 739,
      "qquad": 740,
      "sion": 741,
      "overline": 742,
      "22": 743,
      "ic": 744,
      "om": 745,
      "Ġwor": 746,
      "ĠThis": 747,
      "Ġfactorization": 748,
      "ote": 749,
      "Ġ20": 750,
      "nt": 751,
      "Ġits": 752,
      "ents": 753,
      "44": 754,
      "ĠC": 755,
      "Ġno": 756,
      "ok": 757,
      "Ġma": 758,
      "Ġsee": 759,
      "40": 760,
      "as": 761,
      "Ġsati": 762,
      "sf": 763,
      "Ġadd": 764,
      "}\\\\,": 765,
      "Ġsatisf": 766,
      "Ġ13": 767,
      "Ġany": 768,
      "'s": 769,
      "Ġwho": 770,
      "^{-": 771,
      "Ġgives": 772,
      "ies": 773,
      "lu": 774,
      "to": 775,
      "Ġ25": 776,
      "cdots": 777,
      "Ġmultiples": 778,
      "Ġgreater": 779,
      "Ġsame": 780,
      "Ġinc": 781,
      "arrow": 782,
      "ĠFor": 783,
      "}\\\\,(": 784,
      "ant": 785,
      "Ġneed": 786,
      "la": 787,
      "ply": 788,
      "Ġ17": 789,
      "Ġdiff": 790,
      "ĠHow": 791,
      "Ġdiffer": 792,
      "very": 793,
      "Ġleave": 794,
      "Ġdis": 795,
      "Ġalso": 796,
      "30": 797,
      "43": 798,
      "lac": 799,
      "po": 800,
      "}(": 801,
      "use": 802,
      "ĠThen": 803,
      "Find": 804,
      "bf": 805,
      "ook": 806,
      "}=": 807,
      "Ġmore": 808,
      "Ġdoes": 809,
      "21": 810,
      "plies": 811,
      "Ġmean": 812,
      "28": 813,
      "45": 814,
      "and": 815,
      "000": 816,
      "ightarrow": 817,
      ".\\\\]": 818,
      ".\",": 819,
      "il": 820,
      "Ġsolution": 821,
      "Ġinto": 822,
      "ted": 823,
      "$$": 824,
      "29": 825,
      "ne": 826,
      "pon": 827,
      "Ġour": 828,
      "Ġcu": 829,
      "array": 830,
      ")+": 831,
      ")^": 832,
      "ause": 833,
      "Ġ}": 834,
      "Ġwhat": 835,
      "Ġ19": 836,
      "now": 837,
      "Ġ18": 838,
      "Ġres": 839,
      "tinct": 840,
      "tation": 841,
      "Ġdistinct": 842,
      "37": 843,
      "ke": 844,
      "inal": 845,
      "Ġsome": 846,
      "Ġdivide": 847,
      "textbf": 848,
      "55": 849,
      "For": 850,
      "ould": 851,
      "Ġwould": 852,
      "actly": 853,
      "Ġexactly": 854,
      ".$$": 855,
      "Ġknow": 856,
      "Ġfollows": 857,
      ").": 858,
      "Ġbut": 859,
      "Ġla": 860,
      "36": 861,
      "ga": 862,
      "{\\\\": 863,
      "Ġsec": 864,
      "ither": 865,
      "Ġ24": 866,
      "raction": 867,
      "Ġlet": 868,
      "Ġrepresentation": 869,
      "Ġprimes": 870,
      ")$,": 871,
      "27": 872,
      "\\\\\\\\": 873,
      "Ġfraction": 874,
      "Ġdivides": 875,
      "Ġsecond": 876,
      "int": 877,
      "ays": 878,
      "Ġpowers": 879,
      "$\\\\": 880,
      "am": 881,
      "ĠO": 882,
      "Ġtim": 883,
      "Ġab": 884,
      "leq": 885,
      "Ġend": 886,
      "Ġlast": 887,
      "96": 888,
      "Ġevery": 889,
      "Ġ1000": 890,
      "Ġgiven": 891,
      "ating": 892,
      "ds": 893,
      "ra": 894,
      "Ġrow": 895,
      "olum": 896,
      "Ġright": 897,
      "Ġhow": 898,
      "77": 899,
      "und": 900,
      "left": 901,
      "Ġbec": 902,
      "Ġleaves": 903,
      "ps": 904,
      "}}": 905,
      "ĠIn": 906,
      "66": 907,
      "Ġset": 908,
      "all": 909,
      "fter": 910,
      "right": 911,
      "zer": 912,
      "\\\\]": 913,
      "heck": 914,
      "Ġsid": 915,
      "Ġde": 916,
      "Ġcho": 917,
      "ator": 918,
      "olumn": 919,
      "zero": 920,
      "35": 921,
      "ost": 922,
      "ĠM": 923,
      "Ġplac": 924,
      "Ġpoint": 925,
      "Ġwork": 926,
      "nThe": 927,
      "oti": 928,
      "Ġqu": 929,
      "Ġorder": 930,
      "ie": 931,
      "Ġob": 932,
      "sidu": 933,
      "Ġresidu": 934,
      "Ġpair": 935,
      "Ġmeans": 936,
      "ition": 937,
      "na": 938,
      "Ġover": 939,
      "Ġwant": 940,
      "Ġnon": 941,
      "bt": 942,
      "ces": 943,
      "ity": 944,
      "Ġcou": 945,
      "!$": 946,
      "60": 947,
      "ever": 948,
      "ute": 949,
      "}.\\": 950,
      "\\\\[": 951,
      "Ġtheir": 952,
      "vely": 953,
      "Ġlook": 954,
      "Ġexpress": 955,
      "Ġup": 956,
      "Ġar": 957,
      "tively": 958,
      "ang": 959,
      "Ġrepe": 960,
      "de": 961,
      "Ġden": 962,
      "}$.\\": 963,
      "Ġexpon": 964,
      "Ġterms": 965,
      "Ġwhose": 966,
      "199": 967,
      "Ġsim": 968,
      "Ġwr": 969,
      "Ġinclu": 970,
      "67": 971,
      "per": 972,
      ")$.": 973,
      "Ġ14": 974,
      "Ġequa": 975,
      "Ġsquares": 976,
      "Ġnext": 977,
      "arry": 978,
      "Ġbecause": 979,
      "80": 980,
      "\\\"": 981,
      "ist": 982,
      "nT": 983,
      "not": 984,
      "}\\": 985,
      "Ġcase": 986,
      "cu": 987,
      "Ġj": 988,
      "Ġten": 989,
      "Ġim": 990,
      "Ġout": 991,
      "otal": 992,
      "ten": 993,
      "rite": 994,
      "Ġequation": 995,
      "xpress": 996,
      "Ġtotal": 997,
      "Ġ\\\\\\\\": 998,
      "tic": 999
    },
    "merges": [
      "\\ \\",
      "Ġ $",
      "Ġ t",
      "h e",
      "Ġ Ġ",
      "Ġ \"",
      "Ġ a",
      "Ġ i",
      "e r",
      "Ġt he",
      "Ġ o",
      "l e",
      "r e",
      "Ġ \\\\",
      "t i",
      "n d",
      "v e",
      "ĠĠ Ġ",
      "\" :",
      "Ġo f",
      "h a",
      "Ġ s",
      "Ġi s",
      "Ġ b",
      "Ġ w",
      "Ġ d",
      "o r",
      "Ġ 1",
      "Ġ p",
      "o t",
      "o n",
      "\" ,",
      "u m",
      "$ .",
      "i n",
      "Ġ f",
      "i v",
      "Ġi n",
      "Ġ c",
      "t e",
      "Ġ n",
      "Ġ T",
      "c d",
      "Ġa nd",
      "ha t",
      "b er",
      "um ber",
      "$ ,",
      "i t",
      "q u",
      "a l",
      "Ġ 2",
      "Ġ m",
      "s t",
      "s i",
      "a c",
      "ve l",
      "b le",
      "i g",
      "r o",
      "cd ot",
      "ĠT he",
      "Ġ =",
      "e d",
      "0 0",
      "Ġt hat",
      "ti on",
      "e s",
      "Ġ e",
      "Ġ +",
      "Ġ 3",
      "iv i",
      "Ġd ivi",
      "o l",
      "Ġt o",
      "s e",
      "Ġp o",
      "Ġ 5",
      "a n",
      "Ġw e",
      "Ġb e",
      "Ġb y",
      "e qu",
      "ig it",
      "u l",
      "Ġn umber",
      "g er",
      "o d",
      "L e",
      "Ġin te",
      "a r",
      "equ iv",
      "Ġinte ger",
      "Ġ re",
      "Ġ$ \\\\",
      "Ġa re",
      "p e",
      "i m",
      "1 0",
      "h i",
      "Ġ 4",
      "u tion",
      "ol ution",
      "} ,",
      "Ġ &",
      "e n",
      "o x",
      "c e",
      "t y",
      "ble m",
      "ro blem",
      "Ġd igit",
      "b ox",
      "i nd",
      "box ed",
      "^ {",
      "or y",
      "N umber",
      "m od",
      "p roblem",
      "s olution",
      "le vel",
      "ĠThe ory",
      "Le vel",
      "ty pe",
      "Ġ g",
      "}, {",
      "} $.",
      "si ble",
      "Ġ ha",
      "p mod",
      "r ac",
      "in g",
      "} $",
      "Ġ le",
      "} {",
      "Ġf or",
      "l y",
      "c h",
      "ti ve",
      "f rac",
      "o w",
      "1 1",
      "Ġo n",
      "\\\\ \\",
      "Ġs o",
      "ul ti",
      "ac t",
      "Ġ l",
      "Ġ 7",
      "p le",
      "Ġ (",
      "Ġc o",
      "Ġpo si",
      "m a",
      "Ġposi tive",
      "Ġ -",
      "? \",",
      "Ġm ulti",
      "v er",
      "x t",
      "o re",
      "Ġa n",
      "Ġ 9",
      "r im",
      "l l",
      "1 2",
      "Ġ 6",
      "Ġdivi sible",
      "u s",
      "}$. \"",
      "ha n",
      "c t",
      "Ġ S",
      "Ġp rim",
      "he n",
      "Ġf act",
      "in ce",
      "Ġ W",
      "Ġha ve",
      "Ġc an",
      "Ġfact or",
      "hi s",
      "Ġt han",
      "Ġdivi d",
      "Ġmulti ple",
      "qu a",
      "i r",
      "Ġa s",
      "Ġdigit s",
      "s s",
      "te xt",
      "1 00",
      "a se",
      "Ġs um",
      "u r",
      "Ġw hi",
      "g e",
      "Ġre ma",
      "Ġ v",
      "Ġo r",
      "Ġinteger s",
      "ind er",
      "Ġprim e",
      "Ġ 8",
      "} \\\\",
      "w er",
      "al u",
      "Ġ\\\\ \\\\\\",
      "Ġi t",
      "Ġc on",
      "Ġv alu",
      "Ġwhi ch",
      "u st",
      "Ġrema inder",
      "Ġe x",
      "e t",
      "it h",
      "Ġ u",
      "ig n",
      "Ġw hen",
      "* }",
      "ti n",
      "al ign",
      "Ġm ust",
      "h o",
      "Ġb ase",
      "en t",
      "Ġ1 0",
      "T he",
      "9 9",
      "f ore",
      "a y",
      "w o",
      "Ġpo s",
      "re fore",
      ". \\",
      "_ {",
      "re a",
      "Ġt wo",
      "g cd",
      "Ġ 0",
      "s or",
      "he r",
      "Ġdivi sor",
      "e c",
      "i ve",
      "p re",
      "Ġt his",
      "Ġs u",
      "d d",
      "h us",
      "= \\\\",
      "m al",
      "b e",
      "Ġnumber s",
      "Ġw ith",
      "Ġs mal",
      "Ġle a",
      "Ġha s",
      "Ġpos sible",
      "Ġthe n",
      "Ġn ot",
      "t a",
      "Ġco m",
      "f t",
      "I f",
      "ro m",
      "in e",
      "Ġdivid ed",
      "2 0",
      "Ġg rea",
      "Ġthe re",
      "Ġf ind",
      "d u",
      "ig h",
      "Ġ$ (",
      "igh t",
      "Ġt h",
      "ĠThe refore",
      "1 3",
      "Ġon ly",
      "le st",
      "Ġ1 00",
      ". $",
      "Ġsmal lest",
      "g in",
      "Ġ1 2",
      "m e",
      "Ġle ss",
      "Ġp ro",
      "Ġl ar",
      "tin g",
      "Ġi f",
      "Ġa ll",
      "ir st",
      "ac h",
      "1 5",
      "e nd",
      "Ġ y",
      "1 6",
      ", $",
      "Ġ F",
      "Ġd i",
      "Ġe qu",
      "l i",
      "W e",
      "m on",
      "W hat",
      "Ġu n",
      "Ġ A",
      "ĠT hus",
      "Ġvalu e",
      "Ġlar ge",
      "ĠW e",
      "be gin",
      "t h",
      ") $",
      "u t",
      "Ġ$ $",
      "ĠS ince",
      "qua re",
      "t er",
      "re e",
      "Ġs a",
      "Ġs quare",
      "$. \\",
      "Ġsu ch",
      "2 5",
      "Ġf rom",
      "Ġn e",
      "Ġe ach",
      "Ġm an",
      ". \"",
      "r i",
      "Ġon e",
      "Ġg ive",
      ") (",
      "Ġfactor s",
      "Ġth ree",
      "m es",
      "d igit",
      "Ġf irst",
      "Ġman y",
      "l ine",
      "Ġpo wer",
      "Ġp er",
      "Ġcom mon",
      "Ġlarge st",
      "g r",
      ". \\\\",
      "ro w",
      "en ce",
      "it s",
      "er m",
      "Ġg et",
      ", \\\\",
      "ti mes",
      "& =",
      "l d",
      "} $,",
      "Ġfor m",
      "Ġequ al",
      "Ġ1 1",
      "i z",
      "a t",
      "s wer",
      "Ġun its",
      "f e",
      "ot h",
      "Ġan swer",
      "o ur",
      "Le t",
      "Ġ r",
      "qua d",
      "t her",
      "te st",
      "Ġgrea test",
      "Ġpro du",
      "1 4",
      "2 4",
      "1 7",
      "H ow",
      "Ġb oth",
      "ul d",
      "Ġprodu ct",
      "Ġlea st",
      "Ġd o",
      "fe ct",
      "a tion",
      "Ġa l",
      "ve n",
      "Ġw i",
      "Ġ& \\\\",
      "Ġper fect",
      "@ {",
      "*} \\",
      "ot s",
      "Ġs e",
      "Ġvalu es",
      "Ġt erm",
      "ĠW hat",
      "Ġ k",
      "Ġo dd",
      "Ġwi ll",
      "2 3",
      "w e",
      "\\\\ \\\\\\",
      "Ġm od",
      "Ġdivisor s",
      "Ġa t",
      "ar r",
      "o ver",
      "l o",
      "Ġ If",
      "se n",
      "2 00",
      "p li",
      "c k",
      "$ ?\",",
      "5 0",
      "he re",
      "gr u",
      "Ġmod ul",
      "a b",
      "Ġcon gru",
      "we en",
      "Ġd ec",
      "i d",
      "t ween",
      "ol l",
      "Ġbe tween",
      "1 9",
      "s o",
      "Ġ2 00",
      "Ġ& =",
      "@{ }",
      "Ġe ven",
      "100 0",
      "& \\\\",
      "Ġ E",
      "Ġ h",
      "pre sen",
      "3 3",
      "o nd",
      "Ġre presen",
      ") =",
      "Ġm e",
      "Ġfactor iz",
      "Ġs t",
      "im al",
      "ĠS o",
      "Ġ1 5",
      "Ġs ince",
      "f f",
      "Ġp a",
      ") ,",
      "Ġf oll",
      "Ġmodul o",
      "Ġfoll ow",
      "o u",
      "ld ots",
      "Ġdec imal",
      "Ġo ther",
      "Ġ I",
      "{ (",
      "Ġf our",
      "Ġle ft",
      "pre ss",
      "1 8",
      "Ġ N",
      "Ġ\\\\ [",
      "Ġ1 6",
      "Ġw here",
      "S ince",
      "a te",
      "d er",
      "Ġ B",
      "ta in",
      "} +",
      "Ġ <",
      "Ġ us",
      "Ġthe se",
      "q quad",
      "si on",
      "over line",
      "2 2",
      "i c",
      "o m",
      "Ġw or",
      "ĠT his",
      "Ġfactoriz ation",
      "ot e",
      "Ġ2 0",
      "n t",
      "Ġit s",
      "ent s",
      "4 4",
      "Ġ C",
      "Ġn o",
      "o k",
      "Ġm a",
      "Ġse e",
      "4 0",
      "a s",
      "Ġsa ti",
      "s f",
      "Ġa dd",
      "}\\\\ ,",
      "Ġsati sf",
      "Ġ1 3",
      "Ġan y",
      "' s",
      "Ġw ho",
      "^{ -",
      "Ġgive s",
      "i es",
      "l u",
      "t o",
      "Ġ2 5",
      "cdot s",
      "Ġmultiple s",
      "Ġgrea ter",
      "Ġsa me",
      "Ġin c",
      "ar row",
      "ĠF or",
      "}\\\\, (",
      "an t",
      "Ġne ed",
      "l a",
      "p ly",
      "Ġ1 7",
      "Ġdi ff",
      "Ġ How",
      "Ġdiff er",
      "ver y",
      "Ġlea ve",
      "Ġdi s",
      "Ġal so",
      "3 0",
      "4 3",
      "l ac",
      "p o",
      "} (",
      "u se",
      "ĠThe n",
      "F ind",
      "b f",
      "o ok",
      "} =",
      "Ġm ore",
      "Ġdo es",
      "2 1",
      "pli es",
      "Ġme an",
      "2 8",
      "4 5",
      "a nd",
      "00 0",
      "ight arrow",
      ".\\\\ ]",
      ". \",",
      "i l",
      "Ġs olution",
      "Ġin to",
      "te d",
      "$ $",
      "2 9",
      "n e",
      "p on",
      "Ġo ur",
      "Ġc u",
      "arr ay",
      ") +",
      ") ^",
      "a use",
      "Ġ }",
      "Ġw hat",
      "Ġ1 9",
      "n ow",
      "Ġ1 8",
      "Ġre s",
      "tin ct",
      "ta tion",
      "Ġdis tinct",
      "3 7",
      "k e",
      "in al",
      "Ġso me",
      "Ġdivid e",
      "text bf",
      "5 5",
      "F or",
      "o uld",
      "Ġw ould",
      "act ly",
      "Ġex actly",
      ".$ $",
      "Ġk now",
      "Ġfollow s",
      ") .",
      "Ġb ut",
      "Ġl a",
      "3 6",
      "g a",
      "{ \\\\",
      "Ġs ec",
      "it her",
      "Ġ2 4",
      "rac tion",
      "Ġle t",
      "Ġrepresen tation",
      "Ġprim es",
      ") $,",
      "2 7",
      "\\\\ \\\\",
      "Ġf raction",
      "Ġdivid es",
      "Ġsec ond",
      "in t",
      "ay s",
      "Ġpower s",
      "$ \\\\",
      "a m",
      "Ġ O",
      "Ġt im",
      "Ġa b",
      "le q",
      "Ġe nd",
      "Ġla st",
      "9 6",
      "Ġe very",
      "Ġ100 0",
      "Ġgive n",
      "a ting",
      "d s",
      "r a",
      "Ġ row",
      "ol um",
      "Ġr ight",
      "Ġh ow",
      "7 7",
      "u nd",
      "le ft",
      "Ġbe c",
      "Ġleave s",
      "p s",
      "} }",
      "ĠI n",
      "6 6",
      "Ġs et",
      "al l",
      "ft er",
      "r ight",
      "z er",
      "\\\\ ]",
      "he ck",
      "Ġs id",
      "Ġd e",
      "Ġc ho",
      "at or",
      "olum n",
      "zer o",
      "3 5",
      "o st",
      "Ġ M",
      "Ġp lac",
      "Ġpo int",
      "Ġwor k",
      "n The",
      "o ti",
      "Ġ qu",
      "Ġor der",
      "i e",
      "Ġo b",
      "si du",
      "Ġre sidu",
      "Ġpa ir",
      "Ġmean s",
      "i tion",
      "n a",
      "Ġo ver",
      "Ġw ant",
      "Ġn on",
      "b t",
      "c es",
      "it y",
      "Ġco u",
      "! $",
      "6 0",
      "e ver",
      "u te",
      "} .\\",
      "\\\\ [",
      "Ġthe ir",
      "vel y",
      "Ġl ook",
      "Ġex press",
      "Ġu p",
      "Ġa r",
      "ti vely",
      "an g",
      "Ġre pe",
      "d e",
      "Ġd en",
      "}$. \\",
      "Ġex pon",
      "Ġterm s",
      "Ġwho se",
      "1 99",
      "Ġs im",
      "Ġw r",
      "Ġinc lu",
      "6 7",
      "p er",
      ") $.",
      "Ġ1 4",
      "Ġe qua",
      "Ġsquare s",
      "Ġne xt",
      "arr y",
      "Ġbec ause",
      "8 0",
      "\\ \"",
      "i st",
      "n T",
      "n ot",
      "} \\",
      "Ġc ase",
      "c u",
      "Ġ j",
      "Ġt en",
      "Ġi m",
      "Ġo ut",
      "ot al",
      "te n",
      "ri te",
      "Ġequa tion",
      "x press",
      "Ġt otal",
      "Ġ\\\\ \\\\",
      "ti c"
    ]
  }
}